app/controllers/api/chores_controller.rb

SELECT "chores".* FROM "chores" WHERE "chores"."user_id" = $1  [["user_id", 1]]
---
  def index
    @chores = Chore.all.select { |chore| chore.user_id == params[:id]}

UPDATE "chores" SET "complete" = $1 WHERE "chores"."id" = $2  [["complete", true], ["id", 1]]
---
  def update
    if @chore.update(chore_params)

INSERT INTO "chores" ("title", "description", "due", "user_id", "occupant_id") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["title", "Dishes"], ["description", "Wash all dishes thoroughly and clean up after yourself"], ["due", "2019-07-31 04:00:00"], ["user_id", 2], ["occupant_id", 11]]
---
  def create
      @chore = Chore.create(chore_params)

DELETE FROM "chores" WHERE "chores"."id" = $1  [["id", 3]]
---
  def destroy
   @chore.destroy

SELECT  "chores".* FROM "chores" WHERE "chores"."id" = $1 LIMIT $2  [["id", 4], ["LIMIT", 1]]
---
  def set_chore
    @chore = Chore.find(params[:id])