app/controllers/api/grocery_items_controller.rb

  def create
      @item = GroceryItem.create(item_params)
      if @item.save
---
INSERT INTO "grocery_items" ("category", "title", "quantity", "image", "user_id") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["category", "Food"], ["title", "Totino's Pepperoni Pizza Rolls - 15 CT"], ["quantity", 1], ["image", "https://spoonacular.com/productImages/143855-312x231.jpg"], ["user_id", 1]]

  def set_item
    @item = GroceryItem.find(params[:id])
---
SELECT  "grocery_items".* FROM "grocery_items" WHERE "grocery_items"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]