app/controllers/api/occupants_controller.rb

INSERT INTO "occupants" ("first_name", "last_name", "relationship", "user_id") VALUES ($1, $2, $3, $4) RETURNING "id"  [["first_name", "LongIsland"], ["last_name", "IcedTea"], ["relationship", "Lover"], ["user_id", 2]]
---
  def create
      @occupant = Occupant.new(occupant_params)
      if @occupant.save

DELETE FROM "occupants" WHERE "occupants"."id" = $1  [["id", 5]]
---
  def destroy
   @occupant.destroy

SELECT  "occupants".* FROM "occupants" WHERE "occupants"."id" = $1 LIMIT $2  [["id", 5], ["LIMIT", 1]]
---
  def set_occupant
    @occupant = Occupant.find(params[:id])