app/controllers/api/users_controller.rb

  def create
      @user = User.create(user_params)
---
INSERT INTO "users" ("username", "password_digest", "avatar", "created_at", "updated_at", "first_name", "last_name") VALUES ($1, $2, $3, $4, $5, $6, $7) RETURNING "id"