app/controllers/api/v1/users_controller.rb

INSERT INTO "users" ("username", "password_digest", "avatar", "created_at", "updated_at", "first_name", "last_name") VALUES ($1, $2, $3, $4, $5, $6, $7) RETURNING "id"
---
  def create
      @user = User.create(user_params)