app/models/user.rb

class User < ApplicationRecord
  has_secure_password
  after_create do |user|
    Occupant.create!(first_name: user.first_name, last_name: user.last_name, relationship: "Account Holder", user_id: user.id)
---
INSERT INTO "occupants" ("first_name", "last_name", "relationship", "user_id") VALUES ($1, $2, $3, $4) RETURNING "id"  [["first_name", "Romy"], ["last_name", "Mag"], ["relationship", "Account Holder"], ["user_id", 10]]